      *>
      *> GNUCOBOL FAQ
      *>
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.

       PROCEDURE DIVISION.
       DISPLAY "HELLO WORLD"
       GOBACK.

       END PROGRAM HELLO.
