       IDENTIFICATION DIVISION.
       PROGRAM-ID. HOLA-MUNDO.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 UNO PIC 9 VALUE 1.
       01 DOS PIC 9 VALUE 2.
       01 RESULT PIC 9.

       PROCEDURE DIVISION.
           DISPLAY UNO.
           DISPLAY DOS.
           ADD UNO TO DOS GIVING RESULT.
           DISPLAY RESULT.

       END PROGRAM HOLA-MUNDO.
