       IDENTIFICATION DIVISION.
       PROGRAM-ID. READFILE.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT PUNTUACIONES ASSIGN TO "PUNTUACIONES.TXT"
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD PUNTUACIONES.
       01 PUNTUACION.
               88 ENDOFFILE VALUE HIGH-VALUES.
           02 USERNAME PIC X(48).
           02 PUNTOS PIC 9(9).

       PROCEDURE DIVISION.
           OPEN INPUT PUNTUACIONES.

           READ PUNTUACIONES
               AT END SET ENDOFFILE TO TRUE
           END-READ.
           PERFORM UNTIL ENDOFFILE
               DISPLAY USERNAME " HIZO " PUNTOS
               READ PUNTUACIONES
                   AT END SET ENDOFFILE TO TRUE
               END-READ
           END-PERFORM.
           CLOSE PUNTUACIONES.
       END PROGRAM READFILE.
