       IDENTIFICATION DIVISION.
       PROGRAM-ID. WRITEFILE.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT PUNTUACIONES ASSIGN TO "PUNTUACIONES.TXT"
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD PUNTUACIONES.
       01 PUNTUACION.
           02 USERNAME PIC X(48).
           02 PUNTOS PIC 9(9).

       PROCEDURE DIVISION.
           OPEN OUTPUT PUNTUACIONES.
           DISPLAY "NOMBRE: " WITH NO ADVANCING.
           ACCEPT USERNAME
           PERFORM UNTIL USERNAME = SPACES
               DISPLAY "PUNTUACION: " WITH NO ADVANCING
               ACCEPT PUNTOS
               DISPLAY "HAS METIDO " PUNTUACION
               WRITE PUNTUACION
               DISPLAY "NOMBRE: " WITH NO ADVANCING
               ACCEPT USERNAME
           END-PERFORM.
           CLOSE PUNTUACIONES.
       END PROGRAM WRITEFILE.
